mas 'Xcode', id: 497799835

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'golang'
brew 'mas' # Mac App Store manager
brew 'nvm'
brew 'pinentry-mac' #gpg stuff
brew 'swiftlint'
brew 'wget'

# Apps
cask '1password'
cask '1password-cli'
cask 'adoptopenjdk8'
cask 'android-platform-tools'
cask 'android-sdk'
cask 'android-studio'
cask 'appium'
cask 'atom'
cask 'caffeine'
cask 'charles'
cask 'cocoapods'
cask 'daisydisk'
cask 'dash'
cask 'docker'
cask 'flux'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'google-cloud-sdk'
cask 'jetbrains-toolbox'
cask 'microsoft-office'
cask 'omnigraffle'
# cask 'paintcode'
cask 'reflector'
cask 'scrivener'
cask 'signal'
cask 'sketch'
cask 'slack'
cask 'sourcetree'
# cask 'spotify'
# cask 'tunnelblick'
cask 'visual-studio-code'
cask 'wifi-explorer'
cask 'zoomus'

# Fonts
# cask 'font-jetbrains-mono'

# Drivers
# cask 'logitech-options'
# cask 'yubico-authenticator'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'DuckDuckGo Privacy Essentials', id: 1482920575
mas 'Bible Study', id: 472790630
